Fix graph
